nvxing=["慕容","任","于","厉","柳","钟离","唐","东方","敖","白","南宫","竺","司徒","尉迟","司空","西门","欧阳","尚","上官","水","安","阮","甄","令狐","黎","马","秦","苗","裴","郁","苻","权","祝","皮","庾","曲","赖","瞿","牛","资","公冶","伯赏","轩辕","长孙","司马","鲜于","欧阳","司空","单于","夏侯","上官","南宫","诸葛","巫马","阳佟","太叔","尉迟","呼延","宇文","淳于","子车","闾丘","东郭","归海","司空","乐正","濮阳","西门","百里","令狐","左丘","粱","跋","邵","邢","童"] as String[];

nvming1=["真","踏","凝","竹","若","雨","紫","影","亦","伊","羽","冰","玉","利","映","迎","樱","婴","易","亦","仪","忆","夜","颜","雅","研","雨","幼"] as String[];

nvming2=["菲","星","琪","悠","馨","香","爱","露","落","轩","儿","萱","雪","月","凌","珣","痕","荫","茹","忆","灵","舞","琦","汐","梦","郁","心","韵","然","嫣","安","梦","波","巧","雪","文","梅","丹","丝","玉","荷","枫","兰","琴","海","云","蓉","然","珍","芷"] as String[];



nanxing=["慕容","任","于","厉","柳","钟离","唐","东方","敖","白","南宫","竺","司徒","尉迟","司空","蓝","邵","西门","颜","莫","欧阳","尚","上官","缪","龚","温","褚","邓","白","慕","巫","廖","沙","武","浑","秋","尤","于","章"] as String[];

nanming1=["绝","逸","寒","封","萧","云","燚","轩","海","元","天","寂","岩","伟","尔","曼","立","辉","涛","疾","驳","凛","逊","鹰","威","紊","阁","康","焱","城","誉","祥","虔","胜","穆","豁","匪","霆","凡","枫","豪","铭","罡","扬","垣","师","翼","秋","傥","雨","浩","宇","嘉","熙","志","泽","博","念","波","峻","熙","俊","驰","聪","展","南","松","问","旋","黎","昕","谷","波","凝","靖","易","烟","渊","思","祺","乐","风","华","睿","渊","博","超","天","磊","骁","沅","剑"] as String[];

nanming2=["言","洛","枫","涯","夜","痕","清","浪","尘","阳","武","遥","风","筠","旭","尧","妙","海","平","文","冷","之","尔","阳","宇","正","豪","高","烽"] as String[];
